ThekkanNi/ArdFFTLandT/firmware/src/Pic32Dma.h
/* 
 * File:   Pic32Dma.h
 * Author: aravi
 *
 * Created on February 4, 2025, 12:04 PM
 */

#ifndef PIC32DMA_H
#define	PIC32DMA_H




/* 
 * File:   SpiDmaDriver.h
 * Author: Aravind Ts
 *
 * Created on June 25, 2024, 6:42 PM
 */

#ifndef SPIDMADRIVER_H
#define	SPIDMADRIVER_H


/* 
 * This is Peripheral to memory DMA driver
 * Enable each channel given below to activate DMA respective channel
 *    DmaChannel_(Channel Number)_Array_Data_Type  this represent what type of data type the memory is
 * 1 for BYTE
 * 2 for INT16
 * 3 for UINT16
 * 4 for INT32
 * 5 for UINT32
 
 * This driver also support DMA ping Pong AKA DMA Chaining
 * 4 Drivers are available for DMA Chaining
 */

/********************* CHANNEL DEFINITIONS (VALUES NESCARY FOR EACH CHANEL FUNCTIONSC *******************/

/********************* SINGLE CHANNEL DMA *************************************/

#define DmaChannel_0     
//#define DmaChannel_1 
//#define DmaChannel_2
//#define DmaChannel_3
//#define DmaChannel_4
//#define DmaChannel_5
//#define DmaChannel_6
//#define DmaChannel_7

/********************* DMA CHAINING *******************************************/

//#define Chain_Dma_0_And_1
//#define Chain_Dma_2_And_3
//#define Chain_Dma_4_And_5
//#define Chain_Dma_6_And_7

/********************* MEMORY TO MEMORY ***************************************/

//#define MemtoMemDma_Channel_0
//#define MemtoMemDma_Channel_1
//#define MemtoMemDma_Channel_2
//#define MemtoMemDma_Channel_3

/*             MEMMORY TO PERIPHERAL DMA           */

#define MemToPeripheralCh0
//#define MemToPeripheralCh1
//#define MemToPeripheralCh2
//#define MemToPeripheralCh3
//#define MemToPeripheralCh4
//#define MemToPeripheralCh5
//#define MemToPeripheralCh6
//#define MemToPeripheralCh7



/******************* END OF CHANNEL DEFINITIONS *******************************/


/************* ALL FUNTIONS NESSCARY VALUES ***********************************/
#ifdef DmaChannel_0

#define DmaChannel_0_Array_Data_Type         3
#define DmaChannel_0_InterruptVector         _ADC_EOS_VECTOR
#define DMA_CHANNEL_0_Interupt_PRIORITY      5
#define DMA_CHANNEL_0_Interupt_Sub_PRIORITY  3
#define DmaChannel_0_DataBuffer              &ADCDATA10
#define Dma0RunContinously                   1
#define Dma0InterruptFunction                1
#endif

#ifdef DmaChannel_1

#define DmaChannel_1_Array_Data_Type         3
#define DmaChannel_1_InterruptVector         _ADC_EOS_VECTOR
#define DMA_CHANNEL_1_Interupt_PRIORITY      5
#define DMA_CHANNEL_1_Interupt_Sub_PRIORITY  3
#define DmaChannel_1_DataBuffer              &ADCDATA10
#define Dma1RunContinously                   1
#define Dma1InterruptFunction                1

#endif

#ifdef DmaChannel_2

#define DmaChannel_2_Array_Data_Type         3
#define DmaChannel_2_InterruptVector         _ADC_EOS_VECTOR
#define DMA_CHANNEL_2_Interupt_PRIORITY      5
#define DMA_CHANNEL_2_Interupt_Sub_PRIORITY  3
#define DmaChannel_2_DataBuffer              &ADCDATA10
#define Dma2RunContinously                   1
#define Dma2InterruptFunction                1

#endif

#ifdef DmaChannel_3

#define DmaChannel_3_Array_Data_Type         3
#define DmaChannel_3_InterruptVector         _ADC_EOS_VECTOR
#define DMA_CHANNEL_3_Interupt_PRIORITY      5
#define DMA_CHANNEL_3_Interupt_Sub_PRIORITY  3
#define DmaChannel_3_DataBuffer              &ADCDATA10
#define Dma3RunContinously                   1
#define Dma3InterruptFunction                1

#endif

#ifdef DmaChannel_4

#define DmaChannel_4_Array_Data_Type         3
#define DmaChannel_4_InterruptVector         _ADC_EOS_VECTOR
#define DMA_CHANNEL_4_Interupt_PRIORITY      5
#define DMA_CHANNEL_4_Interupt_Sub_PRIORITY  3
#define DmaChannel_4_DataBuffer              &ADCDATA10
#define Dma4RunContinously                   1
#define Dma4InterruptFunction                1

#endif


#ifdef DmaChannel_5

#define DmaChannel_5_Array_Data_Type         3
#define DmaChannel_5_InterruptVector         _ADC_EOS_VECTOR
#define DMA_CHANNEL_5_Interupt_PRIORITY      5
#define DMA_CHANNEL_5_Interupt_Sub_PRIORITY  3
#define DmaChannel_5_DataBuffer              &ADCDATA10
#define Dma5RunContinously                   1
#define Dma5InterruptFunction                1

#endif

#ifdef DmaChannel_6

#define DmaChannel_6_Array_Data_Type         3
#define DmaChannel_6_InterruptVector         _ADC_EOS_VECTOR
#define DMA_CHANNEL_6_Interupt_PRIORITY      5
#define DMA_CHANNEL_6_Interupt_Sub_PRIORITY  3
#define DmaChannel_6_DataBuffer              &ADCDATA10
#define Dma6RunContinously                   1
#define Dma6InterruptFunction                1

#endif


#ifdef DmaChannel_7

#define DmaChannel_7_Array_Data_Type         3
#define DmaChannel_7_InterruptVector         _ADC_EOS_VECTOR
#define DMA_CHANNEL_7_Interupt_PRIORITY      5
#define DMA_CHANNEL_7_Interupt_Sub_PRIORITY  3
#define DmaChannel_7_DataBuffer              &ADCDATA10
#define Dma7RunContinously                   1
#define Dma7InterruptFunction                1

#endif

#ifdef Chain_Dma_0_And_1

#define DMA_Chain_0_And_1_Array_Data_Type         3
#define DMA_Chain_0_And_1_InterruptVector          _ADC_EOS_VECTOR
#define DMA_Chain_0_Interupt_PRIORITY             5
#define DMA_Chain_1_Interupt_PRIORITY             2
#define DMA_Chain_0_Interupt_Sub_PRIORITY         3
#define DMA_Chain_1_Interupt_Sub_PRIORITY         2
#define DMA_Chain_0_And_1_DataBuffer              &ADCDATA10
#define DMA_Chain_0_And_1_RunContinously          0
#define DMA_Chain_0_And_1_InterruptFunction       1
#endif


#ifdef Chain_Dma_2_And_3

#define DMA_Chain_2_And_3_Array_Data_Type         3
#define DMA_Chain_2_And_3_InterruptVector          _ADC_EOS_VECTOR
#define DMA_Chain_2_Interupt_PRIORITY             5
#define DMA_Chain_3_Interupt_PRIORITY             2
#define DMA_Chain_2_Interupt_Sub_PRIORITY         3
#define DMA_Chain_3_Interupt_Sub_PRIORITY         2
#define DMA_Chain_2_And_3_DataBuffer              &ADCDATA10
#define DMA_Chain_2_And_3_RunContinously          1
#define DMA_Chain_2_And_3_InterruptFunction       1

#endif


