ThekkanNi/ArdFFTLandT/firmware/src/Pic32Dma.h
#ifdef Chain_Dma_4_And_5

#define DMA_Chain_4_And_5_Array_Data_Type         3
#define DMA_Chain_4_And_5_InterruptVector          _ADC_EOS_VECTOR
#define DMA_Chain_4_Interupt_PRIORITY             5
#define DMA_Chain_5_Interupt_PRIORITY             2
#define DMA_Chain_4_Interupt_Sub_PRIORITY         3
#define DMA_Chain_5_Interupt_Sub_PRIORITY         2
#define DMA_Chain_4_And_5_DataBuffer              &ADCDATA10
#define DMA_Chain_4_And_5_RunContinously          1
#define DMA_Chain_4_And_5_InterruptFunction       1

#endif


#ifdef Chain_Dma_6_And_7

#define DMA_Chain_6_And_7_Array_Data_Type         3
#define DMA_Chain_6_And_7_InterruptVector          _ADC_EOS_VECTOR
#define DMA_Chain_6_Interupt_PRIORITY             5
#define DMA_Chain_7_Interupt_PRIORITY             2
#define DMA_Chain_6_Interupt_Sub_PRIORITY         3
#define DMA_Chain_7_Interupt_Sub_PRIORITY         2
#define DMA_Chain_6_And_7_DataBuffer              &ADCDATA10
#define DMA_Chain_6_And_7_RunContinously          1
#define DMA_Chain_6_And_7_InterruptFunction       1

#endif



#ifdef MemtoMemDma_Channel_0

#define MemtoMemDma_0_Array_Data_Type         7
#define MemtoMemDma_0_Interupt_PRIORITY       5
#define MemtoMemDma_0_Interupt_Sub_PRIORITY   3

#endif

#ifdef MemtoMemDma_Channel_1

#define MemtoMemDma_1_Array_Data_Type         7
#define MemtoMemDma_1_Interupt_PRIORITY       5
#define MemtoMemDma_1_Interupt_Sub_PRIORITY   3

#endif

#ifdef MemtoMemDma_Channel_2

#define MemtoMemDma_2_Array_Data_Type         7
#define MemtoMemDma_2_Interupt_PRIORITY       5
#define MemtoMemDma_2_Interupt_Sub_PRIORITY   3

#endif

#ifdef MemtoMemDma_Channel_3

#define MemtoMemDma_3_Array_Data_Type         7
#define MemtoMemDma_3_Interupt_PRIORITY       5
#define MemtoMemDma_3_Interupt_Sub_PRIORITY   3

#endif




/****************  DMA CHANNEL 0 **********************************************/
#if DmaChannel_0_Array_Data_Type == 1
typedef BYTE Dma0BuffferDataType;
#define Dma0SourceSize 1
#endif
#if DmaChannel_0_Array_Data_Type == 2
typedef INT16 Dma0BuffferDataType;
#define Dma0SourceSize 2
#endif
#if DmaChannel_0_Array_Data_Type == 3
typedef UINT16 Dma0BuffferDataType;
#define Dma0SourceSize 2
#endif
#if DmaChannel_0_Array_Data_Type == 4
typedef INT32 Dma0BuffferDataType;
Dma0SourceSize 4
#endif
#if DmaChannel_0_Array_Data_Type == 5
typedef UINT32 Dma0BuffferDataType;
Dma0SourceSize 4
#endif


#if DMA_CHANNEL_0_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_0_INT_NAME      ipl1AUTO
#elif DMA_CHANNEL_0_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_0_INT_NAME      ipl2AUTO
#elif DMA_CHANNEL_0_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_0_INT_NAME      ipl3AUTO
#elif DMA_CHANNEL_0_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_0_INT_NAME      ipl4AUTO
#elif DMA_CHANNEL_0_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_0_INT_NAME      ipl5AUTO
#elif DMA_CHANNEL_0_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_0_INT_NAME      ipl6AUTO
#elif DMA_CHANNEL_0_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_0_INT_NAME      ipl7AUTO
#endif

/****************  DMA CHANNEL 1 **********************************************/
#if DmaChannel_1_Array_Data_Type == 1
typedef BYTE Dma1BuffferDataType;
#define Dma1SourceSize 1
#endif
#if DmaChannel_1_Array_Data_Type == 2
typedef INT16 Dma1BuffferDataType;
#define Dma1SourceSize 2
#endif
#if DmaChannel_1_Array_Data_Type == 3
typedef UINT16 Dma1BuffferDataType;
#define Dma1SourceSize 2
#endif
#if DmaChannel_1_Array_Data_Type == 4
typedef INT32 Dma1BuffferDataType;
#define Dma1SourceSize 4
#endif
#if DmaChannel_1_Array_Data_Type == 5
typedef UINT32 Dma1BuffferDataType;
#define Dma1SourceSize 4
#endif


#if DMA_CHANNEL_1_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_1_INT_NAME      ipl1AUTO
#elif DMA_CHANNEL_1_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_1_INT_NAME      ipl2AUTO
#elif DMA_CHANNEL_1_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_1_INT_NAME      ipl3AUTO
#elif DMA_CHANNEL_1_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_1_INT_NAME      ipl4AUTO
#elif DMA_CHANNEL_1_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_1_INT_NAME      ipl5AUTO
#elif DMA_CHANNEL_1_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_1_INT_NAME      ipl6AUTO
#elif DMA_CHANNEL_1_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_1_INT_NAME      ipl7AUTO
#endif
/****************  DMA CHANNEL 2 **********************************************/
#if DmaChannel_2_Array_Data_Type == 1
typedef BYTE Dma2BuffferDataType;
#define Dma2SourceSize 1
#endif
#if DmaChannel_2_Array_Data_Type == 2
typedef INT16 Dma2BuffferDataType;
#define Dma2SourceSize 2
#endif
#if DmaChannel_2_Array_Data_Type == 3
typedef UINT16 Dma2BuffferDataType;
#define Dma2SourceSize 2
#endif
#if DmaChannel_2_Array_Data_Type == 4
typedef INT32 Dma2BuffferDataType;
#define Dma2SourceSize 4
#endif
#if DmaChannel_2_Array_Data_Type == 5
typedef UINT32 Dma2BuffferDataType;
#define Dma2SourceSize 4
#endif


#if DMA_CHANNEL_2_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_2_INT_NAME      ipl1AUTO
#elif DMA_CHANNEL_2_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_2_INT_NAME      ipl2AUTO
#elif DMA_CHANNEL_2_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_2_INT_NAME      ipl3AUTO
#elif DMA_CHANNEL_2_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_2_INT_NAME      ipl4AUTO
#elif DMA_CHANNEL_2_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_2_INT_NAME      ipl5AUTO
#elif DMA_CHANNEL_2_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_2_INT_NAME      ipl6AUTO
#elif DMA_CHANNEL_2_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_2_INT_NAME      ipl7AUTO
#endif


/****************  DMA CHANNEL 3 **********************************************/
#if DmaChannel_3_Array_Data_Type == 1
typedef BYTE Dma3BuffferDataType;
#define Dma3SourceSize 1
#endif
#if DmaChannel_3_Array_Data_Type == 2
typedef INT16 Dma3BuffferDataType;
#define Dma3SourceSize 2
#endif
#if DmaChannel_3_Array_Data_Type == 3
typedef UINT16 Dma3BuffferDataType;
#define Dma3SourceSize 2
#endif
#if DmaChannel_3_Array_Data_Type == 4
typedef INT32 Dma3BuffferDataType;
#define Dma3SourceSize 4
#endif
#if DmaChannel_3_Array_Data_Type == 5
typedef UINT32 Dma3BuffferDataType;
#define Dma3SourceSize 4
#endif


#if DMA_CHANNEL_3_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_3_INT_NAME      ipl1AUTO
#elif DMA_CHANNEL_3_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_3_INT_NAME      ipl2AUTO
#elif DMA_CHANNEL_3_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_3_INT_NAME      ipl3AUTO
#elif DMA_CHANNEL_3_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_3_INT_NAME      ipl4AUTO
#elif DMA_CHANNEL_3_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_3_INT_NAME      ipl5AUTO
#elif DMA_CHANNEL_3_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_3_INT_NAME      ipl6AUTO
#elif DMA_CHANNEL_3_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_3_INT_NAME      ipl7AUTO
#endif

/****************  DMA CHANNEL 4 **********************************************/
#if DmaChannel_4_Array_Data_Type == 1
typedef BYTE Dma4BuffferDataType;
#define Dma4SourceSize 1
#endif
#if DmaChannel_4_Array_Data_Type == 2
typedef INT16 Dma4BuffferDataType;
#define Dma4SourceSize 2
#endif
#if DmaChannel_4_Array_Data_Type == 3
typedef UINT16 Dma4BuffferDataType;
#define Dma4SourceSize 2
#endif
#if DmaChannel_4_Array_Data_Type == 4
typedef INT32 Dma4BuffferDataType;
#define Dma4SourceSize 4
#endif
#if DmaChannel_4_Array_Data_Type == 5
typedef UINT32 Dma4BuffferDataType;
#define Dma4SourceSize 4
#endif


#if DMA_CHANNEL_4_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_4_INT_NAME      ipl1AUTO
#elif DMA_CHANNEL_4_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_4_INT_NAME      ipl2AUTO
#elif DMA_CHANNEL_4_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_4_INT_NAME      ipl3AUTO
#elif DMA_CHANNEL_4_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_4_INT_NAME      ipl4AUTO
#elif DMA_CHANNEL_4_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_4_INT_NAME      ipl5AUTO
#elif DMA_CHANNEL_4_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_4_INT_NAME      ipl6AUTO
#elif DMA_CHANNEL_4_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_4_INT_NAME      ipl7AUTO
#endif

