ThekkanNi/ArdFFTLandT/firmware/src/Pic32Dma.h
/****************  DMA CHANNEL 5 **********************************************/
#if DmaChannel_5_Array_Data_Type == 1
typedef BYTE Dma5BuffferDataType;
#define Dma5SourceSize 1
#endif
#if DmaChannel_5_Array_Data_Type == 2
typedef INT16 Dma5BuffferDataType;
#define Dma5SourceSize 2
#endif
#if DmaChannel_5_Array_Data_Type == 3
typedef UINT16 Dma5BuffferDataType;
#define Dma5SourceSize 2
#endif
#if DmaChannel_5_Array_Data_Type == 4
#define Dma5SourceSize 4
typedef INT32 Dma5BuffferDataType;
#endif
#if DmaChannel_5_Array_Data_Type == 5
#define Dma5SourceSize 4
typedef UINT32 Dma5BuffferDataType;
#endif


#if   DMA_CHANNEL_5_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_5_INT_NAME      ipl1AUTO
#elif DMA_CHANNEL_5_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_5_INT_NAME      ipl2AUTO
#elif DMA_CHANNEL_5_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_5_INT_NAME      ipl3AUTO
#elif DMA_CHANNEL_5_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_5_INT_NAME      ipl4AUTO
#elif DMA_CHANNEL_5_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_5_INT_NAME      ipl5AUTO
#elif DMA_CHANNEL_5_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_5_INT_NAME      ipl6AUTO
#elif DMA_CHANNEL_5_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_5_INT_NAME      ipl7AUTO
#endif
/****************  DMA CHANNEL 6 **********************************************/
#if DmaChannel_6_Array_Data_Type == 1
typedef BYTE Dma6BuffferDataType;
#define Dma6SourceSize 1
#endif
#if DmaChannel_6_Array_Data_Type == 2
typedef INT16 Dma6BuffferDataType;
#define Dma6SourceSize 2
#endif
#if DmaChannel_6_Array_Data_Type == 3
typedef UINT16 Dma6BuffferDataType;
#define Dma6SourceSize 2
#endif
#if DmaChannel_6_Array_Data_Type == 4
typedef INT32 Dma6BuffferDataType;
#define Dma6SourceSize 4
#endif
#if DmaChannel_6_Array_Data_Type == 5
typedef UINT32 Dma6BuffferDataType;
#define Dma6SourceSize 4
#endif


#if   DMA_CHANNEL_6_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_6_INT_NAME      ipl1AUTO
#elif DMA_CHANNEL_6_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_6_INT_NAME      ipl2AUTO
#elif DMA_CHANNEL_6_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_6_INT_NAME      ipl3AUTO
#elif DMA_CHANNEL_6_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_6_INT_NAME      ipl4AUTO
#elif DMA_CHANNEL_6_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_6_INT_NAME      ipl5AUTO
#elif DMA_CHANNEL_6_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_6_INT_NAME      ipl6AUTO
#elif DMA_CHANNEL_6_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_6_INT_NAME      ipl7AUTO
#endif


/****************  DMA CHANNEL 7 **********************************************/
#if DmaChannel_7_Array_Data_Type == 1
typedef BYTE Dma7BuffferDataType;
#define Dma7SourceSize 1
#endif
#if DmaChannel_7_Array_Data_Type == 2
typedef INT16 Dma7BuffferDataType;
#define Dma7SourceSize 2
#endif
#if DmaChannel_7_Array_Data_Type == 3
typedef UINT16 Dma7BuffferDataType;
#define Dma7SourceSize 2
#endif
#if DmaChannel_7_Array_Data_Type == 4
typedef INT32 Dma7BuffferDataType;
#define Dma7SourceSize 4
#endif
#if DmaChannel_7_Array_Data_Type == 5
typedef UINT32 Dma7BuffferDataType;
#define Dma7SourceSize 4
#endif


#if   DMA_CHANNEL_7_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_7_INT_NAME      ipl1AUTO
#elif DMA_CHANNEL_7_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_7_INT_NAME      ipl2AUTO
#elif DMA_CHANNEL_7_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_7_INT_NAME      ipl3AUTO
#elif DMA_CHANNEL_7_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_7_INT_NAME      ipl4AUTO
#elif DMA_CHANNEL_7_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_7_INT_NAME      ipl5AUTO
#elif DMA_CHANNEL_7_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_7_INT_NAME      ipl6AUTO
#elif DMA_CHANNEL_7_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_7_INT_NAME      ipl7AUTO
#endif


/***** FUNCTIONS FOR DMA CHANNELS *********************************************/

#ifdef DmaChannel_0
void SpiDmaSingleChannel_0_Config(Dma0BuffferDataType *Array,size_t BufferSize);
inline void StartDma0();
inline void StopDma0();
bool CheckDma0Flag();
#if Dma0InterruptFunction == 1
void AttachDMA0Interrupt(void *(Address));
void (*DMA0LocalIsr)(void);
#endif
#endif

#ifdef DmaChannel_1
void SpiDmaSingleChannel_1_Config(Dma1BuffferDataType *Array,size_t BufferSize);
inline void StartDma1();
inline void StopDma1();
bool CheckDma1Flag();
#if Dma1InterruptFunction == 1
void AttachDMA1Interrupt(void *(Address));
#endif
#endif

#ifdef DmaChannel_2
void SpiDmaSingleChannel_2_Config(Dma2BuffferDataType *Array,size_t BufferSize);
inline void StartDma2();
inline void StopDma2();
#if Dma2InterruptFunction == 1
void AttachDMA2Interrupt(void *(Address));
#endif
#endif

#ifdef DmaChannel_3
void SpiDmaSingleChannel_3_Config(Dma3BuffferDataType *Array,size_t BufferSize);
inline void StartDma3();
inline void StopDma3();
#if Dma3InterruptFunction == 1
void AttachDMA3Interrupt(void *(Address));
#endif
#endif

#ifdef DmaChannel_4
void SpiDmaSingleChannel_4_Config(Dma4BuffferDataType *Array,size_t BufferSize);
inline void StartDma4();
inline void StopDma4();
#if Dma4InterruptFunction == 1
void AttachDMA4Interrupt(void *(Address));
#endif
#endif

#ifdef DmaChannel_5
void SpiDmaSingleChannel_5_Config(Dma5BuffferDataType *Array,size_t BufferSize);
inline void StartDma5();
inline void StopDma5();
#if Dma5InterruptFunction == 1
void AttachDMA5Interrupt(void *(Address));
#endif
#endif

#ifdef DmaChannel_6
void SpiDmaSingleChannel_6_Config(Dma6BuffferDataType *Array,size_t BufferSize);
inline void StartDma6();
inline void StopDma6();
#if Dma6InterruptFunction == 1
void AttachDMA6Interrupt(void *(Address));
#endif
#endif

#ifdef DmaChannel_7
void SpiDmaSingleChannel_7_Config(Dma7BuffferDataType *Array,size_t BufferSize);
inline void StartDma7();
inline void StopDma7();
#if Dma7InterruptFunction == 1
void AttachDMA7Interrupt(void *(Address));
#endif
#endif

/******************* CHAINING DMA *********************************************/
#ifdef Chain_Dma_0_And_1

#if DMA_Chain_0_And_1_Array_Data_Type == 1
typedef BYTE Chain_0_1_BuferDataType;
#define Dma0SourceSize 1
#define Dma1SourceSize 1
#endif
#if DMA_Chain_0_And_1_Array_Data_Type == 2
typedef INT16 Chain_0_1_BuferDataType;
#define Dma0SourceSize 2
#define Dma1SourceSize 2
#endif
#if DMA_Chain_0_And_1_Array_Data_Type == 3
typedef UINT16 Chain_0_1_BuferDataType;
#define Dma0SourceSize 2
#define Dma1SourceSize 2
#endif
#if DMA_Chain_0_And_1_Array_Data_Type == 4
typedef INT32 Chain_0_1_BuferDataType;
#define Dma0SourceSize 4
#define Dma1SourceSize 4
#endif
#if DMA_Chain_0_And_1_Array_Data_Type == 5
typedef UINT32 Chain_0_1_BuferDataType;
#define Dma0SourceSize 4
#define Dma1SourceSize 4
#endif


#if   DMA_Chain_0_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_0_INT_NAME      ipl1AUTO
#elif DMA_Chain_0_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_0_INT_NAME      ipl2AUTO
#elif DMA_Chain_0_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_0_INT_NAME      ipl3AUTO
#elif DMA_Chain_0_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_0_INT_NAME      ipl4AUTO
#elif DMA_Chain_0_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_0_INT_NAME      ipl5AUTO
#elif DMA_Chain_0_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_0_INT_NAME      ipl6AUTO
#elif DMA_Chain_0_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_0_INT_NAME      ipl7AUTO
#endif

