ThekkanNi/ArdFFTLandT/firmware/src/Pic32Dma.h
#if   DMA_Chain_1_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_1_INT_NAME      ipl1AUTO
#elif DMA_Chain_1_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_1_INT_NAME      ipl2AUTO
#elif DMA_Chain_1_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_1_INT_NAME      ipl3AUTO
#elif DMA_Chain_1_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_1_INT_NAME      ipl4AUTO
#elif DMA_Chain_1_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_1_INT_NAME      ipl5AUTO
#elif DMA_Chain_1_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_1_INT_NAME      ipl6AUTO
#elif DMA_Chain_1_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_1_INT_NAME      ipl7AUTO
#endif

#endif

#ifdef Chain_Dma_2_And_3

#if DMA_Chain_2_And_3_Array_Data_Type == 1
typedef BYTE Chain_2_3_BuferDataType;
#define Dma2SourceSize 1
#define Dma3SourceSize 1
#endif
#if DMA_Chain_2_And_3_Array_Data_Type == 2
typedef INT16 Chain_2_3_BuferDataType;
#define Dma2SourceSize 2
#define Dma3SourceSize 2
#endif
#if DMA_Chain_2_And_3_Array_Data_Type == 3
typedef UINT16 Chain_2_3_BuferDataType;
#define Dma2SourceSize 2
#define Dma3SourceSize 2
#endif
#if DMA_Chain_2_And_3_Array_Data_Type == 4
typedef INT32 Chain_2_3_BuferDataType;
#define Dma2SourceSize 4
#define Dma3SourceSize 4
#endif
#if DMA_Chain_2_And_3_Array_Data_Type == 5
typedef UINT32 Chain_2_3_BuferDataType;
#define Dma2SourceSize 4
#define Dma3SourceSize 4
#endif


#if   DMA_Chain_2_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_2_INT_NAME      ipl1AUTO
#elif DMA_Chain_2_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_2_INT_NAME      ipl2AUTO
#elif DMA_Chain_2_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_2_INT_NAME      ipl3AUTO
#elif DMA_Chain_2_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_2_INT_NAME      ipl4AUTO
#elif DMA_Chain_2_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_2_INT_NAME      ipl5AUTO
#elif DMA_Chain_2_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_2_INT_NAME      ipl6AUTO
#elif DMA_Chain_2_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_2_INT_NAME      ipl7AUTO
#endif

#if   DMA_Chain_3_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_3_INT_NAME      ipl1AUTO
#elif DMA_Chain_3_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_3_INT_NAME      ipl2AUTO
#elif DMA_Chain_3_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_1_INT_NAME      ipl3AUTO
#elif DMA_Chain_3_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_3_INT_NAME      ipl4AUTO
#elif DMA_Chain_3_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_3_INT_NAME      ipl5AUTO
#elif DMA_Chain_3_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_3_INT_NAME      ipl6AUTO
#elif DMA_Chain_3_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_3_INT_NAME      ipl7AUTO
#endif

#endif


#ifdef Chain_Dma_4_And_5

#if DMA_Chain_4_And_5_Array_Data_Type == 1
typedef BYTE Chain_4_5_BuferDataType;
#define Dma4SourceSize 1
#define Dma5SourceSize 1
#endif
#if DMA_Chain_4_And_5_Array_Data_Type == 2
typedef INT16 Chain_4_5_BuferDataType;
#define Dma4SourceSize 2
#define Dma5SourceSize 2
#endif
#if DMA_Chain_4_And_5_Array_Data_Type == 3
typedef UINT16 Chain_4_5_BuferDataType;
#define Dma4SourceSize 2
#define Dma5SourceSize 2
#endif
#if DMA_Chain_4_And_5_Array_Data_Type == 4
typedef INT32 Chain_4_5_BuferDataType;
#define Dma4SourceSize 4
#define Dma5SourceSize 4
#endif
#if DMA_Chain_4_And_5_Array_Data_Type == 5
typedef UINT32 Chain_4_5_BuferDataType;
#define Dma4SourceSize 4
#define Dma5SourceSize 4
#endif


#if   DMA_Chain_4_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_4_INT_NAME      ipl1AUTO
#elif DMA_Chain_4_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_4_INT_NAME      ipl2AUTO
#elif DMA_Chain_4_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_4_INT_NAME      ipl3AUTO
#elif DMA_Chain_4_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_4_INT_NAME      ipl4AUTO
#elif DMA_Chain_4_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_4_INT_NAME      ipl5AUTO
#elif DMA_Chain_4_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_4_INT_NAME      ipl6AUTO
#elif DMA_Chain_4_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_4_INT_NAME      ipl7AUTO
#endif

#if   DMA_Chain_5_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_5_INT_NAME      ipl1AUTO
#elif DMA_Chain_5_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_5_INT_NAME      ipl2AUTO
#elif DMA_Chain_5_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_5_INT_NAME      ipl3AUTO
#elif DMA_Chain_5_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_5_INT_NAME      ipl4AUTO
#elif DMA_Chain_5_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_5_INT_NAME      ipl5AUTO
#elif DMA_Chain_5_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_5_INT_NAME      ipl6AUTO
#elif DMA_Chain_5_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_5_INT_NAME      ipl7AUTO
#endif

#endif


#ifdef Chain_Dma_6_And_7

#if DMA_Chain_6_And_7_Array_Data_Type == 1
typedef BYTE Chain_6_7_BuferDataType;
#define Dma6SourceSize 1
#define Dma7SourceSize 1
#endif
#if DMA_Chain_6_And_7_Array_Data_Type == 2
typedef INT16 Chain_6_7_BuferDataType;
#define Dma6SourceSize 2
#define Dma7SourceSize 2
#endif
#if DMA_Chain_6_And_7_Array_Data_Type == 3
typedef UINT16 Chain_6_7_BuferDataType;
#define Dma6SourceSize 2
#define Dma7SourceSize 2
#endif
#if DMA_Chain_6_And_7_Array_Data_Type == 4
typedef INT32 Chain_6_7_BuferDataType;
#define Dma6SourceSize 4
#define Dma7SourceSize 4
#endif
#if DMA_Chain_6_And_7_Array_Data_Type == 5
typedef UINT32 Chain_6_7_BuferDataType;
#define Dma6SourceSize 4
#define Dma7SourceSize 4
#endif


#if   DMA_Chain_6_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_6_INT_NAME      ipl1AUTO
#elif DMA_Chain_6_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_6_INT_NAME      ipl2AUTO
#elif DMA_Chain_6_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_6_INT_NAME      ipl3AUTO
#elif DMA_Chain_6_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_6_INT_NAME      ipl4AUTO
#elif DMA_Chain_6_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_6_INT_NAME      ipl5AUTO
#elif DMA_Chain_6_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_6_INT_NAME      ipl6AUTO
#elif DMA_Chain_6_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_6_INT_NAME      ipl7AUTO
#endif

