ThekkanNi/ArdFFTLandT/firmware/src/Pic32Dma.h
#if   DMA_Chain_7_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_7_INT_NAME      ipl1AUTO
#elif DMA_Chain_7_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_7_INT_NAME      ipl2AUTO
#elif DMA_Chain_7_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_7_INT_NAME      ipl3AUTO
#elif DMA_Chain_7_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_7_INT_NAME      ipl4AUTO
#elif DMA_Chain_7_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_7_INT_NAME      ipl5AUTO
#elif DMA_Chain_7_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_7_INT_NAME      ipl6AUTO
#elif DMA_Chain_7_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_7_INT_NAME      ipl7AUTO
#endif

#endif

/********* FUNCTIONS FOR DMA CHAINING *****************************************/

#ifdef Chain_Dma_0_And_1
void Dma_Chain_Init_0_And_1(Chain_0_1_BuferDataType *Array1,size_t BufferSize1,Chain_0_1_BuferDataType *Array2,size_t BufferSize2);
bool CheckDma0Flag();
bool CheckDma1Flag();
void Start_Dma_Chain_0_1();
void Stop_Dma_Chain_0_1();
void (*DMA_Chain_0_LocalIsr)(void);
void (*DMA_Chain_1_LocalIsr)(void);
void AttachDMA_Chain_0_And_1Interrupt(void *(Address1),void *(Address2));
#endif

#ifdef Chain_Dma_2_And_3
void Dma_Chain_Init_2_And_3(Chain_2_3_BuferDataType *Array1,size_t BufferSize1,Chain_2_3_BuferDataType *Array2,size_t BufferSize2);
bool CheckDma2Flag();
bool CheckDma3Flag();
void Start_Dma_Chain_2_3();
void Stop_Dma_Chain_2_3();
void (*DMA_Chain_2_LocalIsr)(void);
void (*DMA_Chain_3_LocalIsr)(void);
void AttachDMA_Chain_2_And_3Interrupt(void *(Address1),void *(Address2));
#endif

#ifdef Chain_Dma_4_And_5
void Dma_Chain_Init_4_And_5(Chain_4_5_BuferDataType *Array1,size_t BufferSize1,Chain_4_5_BuferDataType *Array2,size_t BufferSize2);
bool CheckDma4Flag();
bool CheckDma5Flag();
void Start_Dma_Chain_4_5();
void Stop_Dma_Chain_4_5();
void (*DMA_Chain_4_LocalIsr)(void);
void (*DMA_Chain_5_LocalIsr)(void);
void AttachDMA_Chain_4_And_5Interrupt(void *(Address1),void *(Address2));
#endif

#ifdef Chain_Dma_6_And_7
void Dma_Chain_Init_0_And_1(Chain_6_7_BuferDataType *Array1,size_t BufferSize1,Chain_6_7_BuferDataType *Array2,size_t BufferSize2);
bool CheckDma6Flag();
bool CheckDma7Flag();
void Start_Dma_Chain_6_7();
void Stop_Dma_Chain_6_7();
void (*DMA_Chain_6_LocalIsr)(void);
void (*DMA_Chain_7_LocalIsr)(void);
void AttachDMA_Chain_6_And_7Interrupt(void *(Address1),void *(Address2));
#endif
/******************** MEM TO MEM **********************************************/

/************* CHANNEL 0 ******************************************************/

#ifdef MemtoMemDma_Channel_0

#if MemtoMemDma_0_Array_Data_Type == 1
typedef BYTE Dma0BuffferDataType;
#endif
#if MemtoMemDma_0_Array_Data_Type == 2
typedef INT16 Dma0BuffferDataType;
#endif
#if MemtoMemDma_0_Array_Data_Type == 3
typedef UINT16 Dma0BuffferDataType;
#endif
#if MemtoMemDma_0_Array_Data_Type == 4
typedef INT32 Dma0BuffferDataType;
#endif
#if MemtoMemDma_0_Array_Data_Type == 5
typedef UINT32 Dma0BuffferDataType;
#endif
#if MemtoMemDma_0_Array_Data_Type == 6
typedef float Dma0BuffferDataType;
#endif
#if MemtoMemDma_0_Array_Data_Type == 7
typedef double Dma0BuffferDataType;
#endif


#if MemtoMemDma_0_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_0_INT_NAME      ipl1AUTO
#elif MemtoMemDma_0_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_0_INT_NAME      ipl2AUTO
#elif MemtoMemDma_0_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_0_INT_NAME      ipl3AUTO
#elif MemtoMemDma_0_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_0_INT_NAME      ipl4AUTO
#elif MemtoMemDma_0_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_0_INT_NAME      ipl5AUTO
#elif MemtoMemDma_0_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_0_INT_NAME      ipl6AUTO
#elif MemtoMemDma_0_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_0_INT_NAME      ipl7AUTO
#endif

#endif

#ifdef MemtoMemDma_Channel_1
#if MemtoMemDma_1_Array_Data_Type == 1
typedef BYTE Dma1BuffferDataType;
#endif
#if MemtoMemDma_1_Array_Data_Type == 2
typedef INT16 Dma1BuffferDataType;
#endif
#if MemtoMemDma_1_Array_Data_Type == 3
typedef UINT16 Dma1BuffferDataType;
#endif
#if MemtoMemDma_1_Array_Data_Type == 4
typedef INT32 Dma1BuffferDataType;
#endif
#if MemtoMemDma_1_Array_Data_Type == 5
typedef UINT32 Dma1BuffferDataType;
#endif
#if MemtoMemDma_1_Array_Data_Type == 6
typedef float Dma1BuffferDataType;
#endif
#if MemtoMemDma_1_Array_Data_Type == 7
typedef double Dma1BuffferDataType;
#endif

#if MemtoMemDma_1_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_1_INT_NAME      ipl1AUTO
#elif MemtoMemDma_1_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_1_INT_NAME      ipl2AUTO
#elif MemtoMemDma_1_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_1_INT_NAME      ipl3AUTO
#elif MemtoMemDma_1_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_1_INT_NAME      ipl4AUTO
#elif MemtoMemDma_1_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_1_INT_NAME      ipl5AUTO
#elif MemtoMemDma_1_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_1_INT_NAME      ipl6AUTO
#elif MemtoMemDma_1_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_1_INT_NAME      ipl7AUTO
#endif

#endif

#ifdef MemtoMemDma_Channel_2

#if MemtoMemDma_2_Array_Data_Type == 1
typedef BYTE Dma2BuffferDataType;
#endif
#if MemtoMemDma_2_Array_Data_Type == 2
typedef INT16 Dma2BuffferDataType;
#endif
#if MemtoMemDma_2_Array_Data_Type == 3
typedef UINT16 Dma2BuffferDataType;
#endif
#if MemtoMemDma_2_Array_Data_Type == 4
typedef INT32 Dma2BuffferDataType;
#endif
#if MemtoMemDma_2_Array_Data_Type == 5
typedef UINT32 Dma2BuffferDataType;
#endif
#if MemtoMemDma_2_Array_Data_Type == 6
typedef float Dma2BuffferDataType;
#endif
#if MemtoMemDma_2_Array_Data_Type == 7
typedef double Dma2BuffferDataType;
#endif

#if MemtoMemDma_2_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_2_INT_NAME      ipl1AUTO
#elif MemtoMemDma_2_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_2_INT_NAME      ipl2AUTO
#elif MemtoMemDma_2_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_2_INT_NAME      ipl3AUTO
#elif MemtoMemDma_2_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_2_INT_NAME      ipl4AUTO
#elif MemtoMemDma_2_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_2_INT_NAME      ipl5AUTO
#elif MemtoMemDma_2_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_2_INT_NAME      ipl6AUTO
#elif MemtoMemDma_2_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_2_INT_NAME      ipl7AUTO
#endif

#endif
#ifdef MemtoMemDma_Channel_3

#if MemtoMemDma_3_Array_Data_Type == 1
typedef BYTE Dma3BuffferDataType;
#endif
#if MemtoMemDma_3_Array_Data_Type == 2
typedef INT16 Dma3BuffferDataType;
#endif
#if MemtoMemDma_3_Array_Data_Type == 3
typedef UINT16 Dma3BuffferDataType;
#endif
#if MemtoMemDma_3_Array_Data_Type == 4
typedef INT32 Dma3BuffferDataType;
#endif
#if MemtoMemDma_3_Array_Data_Type == 5
typedef UINT32 Dma3BuffferDataType;
#endif
#if MemtoMemDma_3_Array_Data_Type == 6
typedef float Dma3BuffferDataType;
#endif
#if MemtoMemDma_3_Array_Data_Type == 7
typedef double Dma3BuffferDataType;
#endif

#if MemtoMemDma_3_Interupt_PRIORITY == 1
#define     DMA_CHANNEL_3_INT_NAME      ipl1AUTO
#elif MemtoMemDma_3_Interupt_PRIORITY == 2
#define     DMA_CHANNEL_3_INT_NAME      ipl2AUTO
#elif MemtoMemDma_3_Interupt_PRIORITY == 3
#define     DMA_CHANNEL_3_INT_NAME      ipl3AUTO
#elif MemtoMemDma_3_Interupt_PRIORITY == 4
#define     DMA_CHANNEL_3_INT_NAME      ipl4AUTO
#elif MemtoMemDma_3_Interupt_PRIORITY == 5
#define     DMA_CHANNEL_3_INT_NAME      ipl5AUTO
#elif MemtoMemDma_3_Interupt_PRIORITY == 6
#define     DMA_CHANNEL_3_INT_NAME      ipl6AUTO
#elif MemtoMemDma_3_Interupt_PRIORITY == 7
#define     DMA_CHANNEL_3_INT_NAME      ipl7AUTO
#endif

#endif
/******************** MEMORY TO MEMORY DMA FUNCTIONS **************************/

#ifdef MemtoMemDma_Channel_0
void MemToMemDma0(Dma0BuffferDataType *Array1,Dma0BuffferDataType *Array2,UINT16 Size);
void StartMemtoMemDma0();
inline void StopMemtoMemDma0();
#endif

#ifdef MemtoMemDma_Channel_1

void MemToMemDma1(Dma1BuffferDataType *Array1,Dma1BuffferDataType *Array2,UINT16 Size);
void StartMemtoMemDma1();
inline void StopMemtoMemDma1();

#endif

#ifdef MemtoMemDma_Channel_2

void MemToMemDma2(Dma2BuffferDataType *Array1,Dma2BuffferDataType *Array2,UINT16 Size);
void StartMemtoMemDma2();
inline void StopMemtoMemDma2();

#endif

#ifdef MemtoMemDma_Channel_3

void MemToMemDma3(Dma2BuffferDataType *Array1,Dma2BuffferDataType *Array2,UINT16 Size);
void StartMemtoMemDma3();
inline void StopMemtoMemDma3();

#endif

