ThekkanNi/ArdFFTLandT/firmware/src/Pic32Dma.h
#ifdef  MemToPeripheralCh0

void InitMemToPerSrcDma0(BYTE InterruptVector,volatile void *Peripheral,BYTE Priority);
void SetMemToPerSrcAddrs0(void *Address, UINT16 Size);
void StartMemToPerDma0(void);
void StopMemToPerDma0(void);

#endif
#ifdef  MemToPeripheralCh1

void InitMemToPerSrcDma1(BYTE InterruptVector,volatile void *Peripheral,BYTE Priority);
void SetMemToPerSrcAddrs1(void *Address, UINT16 Size);
void StartMemToPerDma1(void);
void StopMemToPerDma1(void);

#endif
#ifdef  MemToPeripheralCh2

void InitMemToPerSrcDma2(BYTE InterruptVector,volatile void *Peripheral,BYTE Priority);
void SetMemToPerSrcAddrs2(void *Address, UINT16 Size);
void StartMemToPerDma2(void);
void StopMemToPerDma2(void);

#endif
#ifdef  MemToPeripheralCh3

void InitMemToPerSrcDma3(BYTE InterruptVector,volatile void *Peripheral,BYTE Priority);
void SetMemToPerSrcAddrs3(void *Address, UINT16 Size);
void StartMemToPerDma3(void);
void StopMemToPerDma3(void);

#endif
#ifdef  MemToPeripheralCh4

void InitMemToPerSrcDma4(BYTE InterruptVector,volatile void *Peripheral,BYTE Priority);
void SetMemToPerSrcAddrs4(void *Address, UINT16 Size);
void StartMemToPerDma4(void);
void StopMemToPerDma4(void);

#endif
#ifdef  MemToPeripheralCh5

void InitMemToPerSrcDma5(BYTE InterruptVector,volatile void *Peripheral,BYTE Priority);
void SetMemToPerSrcAddrs5(void *Address, UINT16 Size);
void StartMemToPerDma5(void);
void StopMemToPerDma5(void);

#endif
#ifdef  MemToPeripheralCh6
void InitMemToPerSrcDma6(BYTE InterruptVector,volatile void *Peripheral,BYTE Priority);
void SetMemToPerSrcAddrs6(void *Address, UINT16 Size);
void StartMemToPerDma6(void);
void StopMemToPerDma6(void);

#endif
#ifdef  MemToPeripheralCh7

void InitMemToPerSrcDma7(BYTE InterruptVector,volatile void *Peripheral,BYTE Priority);
void SetMemToPerSrcAddrs7(void *Address, UINT16 Size);
void StartMemToPerDma7(void);
void StopMemToPerDma7(void);
#endif
/********** END OF FILE ********************************************************/




//
//#define MemToPeripheralCh1
//#define MemToPeripheralCh2
//#define MemToPeripheralCh3
//#define MemToPeripheralCh4
//#define MemToPeripheralCh5
//#define MemToPeripheralCh6
//#define MemToPeripheralCh7


#ifdef	__cplusplus
extern "C" {
#endif




#ifdef	__cplusplus
}
#endif

#endif	/* SPIDMADRIVER_H */













#ifdef	__cplusplus
extern "C" {
#endif




#ifdef	__cplusplus
}
#endif

#endif	/* PIC32DMA_H */

